---
kind: method
id: M:Autodesk.Revit.DB.PropertySetElement.GetStructuralAsset
source: html/20f9ad9d-2fe7-dffe-dc9d-968dbc2bb9dd.htm
---
# Autodesk.Revit.DB.PropertySetElement.GetStructuralAsset Method

Gets a copy of the StructuralAsset.

## Syntax (C#)
```csharp
public StructuralAsset GetStructuralAsset()
```